app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all.order("id DESC")
---
SELECT `blogs`.* FROM `blogs`  ORDER BY id DESC

  def create
    Blog.create(blog_params)
---
INSERT INTO `blogs` (`title`, `image`, `text`, `created_at`, `updated_at`) VALUES ('fefefe', '', 'fefefe', '2018-09-16 01:24:30', '2018-09-16 01:24:30')

  def update
      blog = Blog.find(params[:id])
      blog.update(blog_params) if user_signed_in?
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
UPDATE `blogs` SET `image` = '', `text` = 'ssssssf', `updated_at` = '2018-09-16 01:24:14' WHERE `blogs`.`id` = 1

  def destroy
      blog = Blog.find(params[:id])
      blog.destroy if user_signed_in?
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 1